import math
# Квадрат числа
a = int(input("Введіть число, щоб дізнатися його квадрат: "))
print("Квадрат числа дорівнює: ", a * a)

# Середнє трьох чисел
a = int(input("Введіть перше число, щоб дізнатись середнє трьох чисел: "))
b = int(input("Введіть друге число: "))
c = int(input("Введіть третє число: "))
print("Середнє трьох чисел дорівнює:", round((a + b + c) / 3, 1))

# Перетворення хвилин у години
minutes = int(input("Введіть кількість хвилин, для перетворення їх на години: "))
a = minutes // 60
b = minutes % 60
print(a, "год.,", b, "хв.")

# Розрахунок знижки
price = float(input("Для розрахунку, введіть ціну: "))
discount = int(input("Введіть знижку (%): "))
calculation = price * discount / 100
print("Ціна зі знижкою: ", price - calculation)

# Остання цифра числа
перший спосіб
nam = int(input("Введіть любе число, я виведу останню цифру на єкран: "))
print(nam % 10)

# другий спосіб
nam = input("Введіть любе число, я виведу останню цифру на єкран: ")
print(nam[-1])

# Периметр прямокутника
a = int(input("Для обчислення периметра прямокутника, введіть довжину: "))
b = int(input("Введіть ширину: "))
print("Периметр прямокутника дорівнює: ", 2 * (a + b))

# Виведення числа в стовпчик
a = input("Введіть будь ласка будь-яке 4-х значне число: ") # захисту від дурня нема
print(a[0])
print(a[1])
print(a[2])
print(a[3])

